app/Controllers/Auth/AuthController.php

    public function loginProcess()
    {
       // Ambil data login dari form
       $username = $this->request->getPost('username');
       $password = $this->request->getPost('password'); // Tidak perlu lagi di-hash di sini

       // Cek apakah user ada di database
       $model = new UserModel();
       $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'angelika'
 LIMIT 1