app/Controllers/Auth/AuthController.php

    public function loginProcess()
    {
        // Ambil data login dari form
        $username = $this->request->getPost('username');
        $password = md5($this->request->getPost('password')); // Anda bisa mengganti enkripsi jika perlu

        // Cek apakah user ada di database
        $model = new UserModel();
        $user = $model->where('username', $username)
                      ->where('password', $password)
                      ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'superadmin2025'
AND `password` = '752eb0f7adbb5ec5f65de6c2ec0eb277'
 LIMIT 1