app/Controllers/Admin/CourseController.php

SELECT *
FROM `courses`
---
    public function index()
    {
        // Mengambil semua data kursus
        $data['courses'] = $this->courseModel->findAll();