app/Controllers/Admin/InstructorController.php

SELECT *
FROM `instructors`
---
    public function index()
    {
        $data['instructors'] = $this->instructorModel->findAll();

SELECT *
FROM `instructors`
WHERE `instructors`.`id` = '7'
---
    public function edit($id)
    {
        $data['instructor'] = $this->instructorModel->find($id);

UPDATE `instructors` SET `name` = 'Aden Arista', `email` = 'admin@super.com', `phone` = '085374663122', `expertise` = '2 Tahun Pengalaman', `image` = 'uploads/instructor_picture/instructor_678159a38e2486.08913293.jpeg', `updated_at` = '2025-01-10 11:32:19'
WHERE `instructors`.`id` IN ('8')
---
    public function update($id)
    {

        $this->instructorModel->update($id, [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'expertise' => $this->request->getPost('expertise')
        ]);