app/Controllers/Admin/RegisterController.php

    public function delete($id)
    {
        $registerModel = new RegisterModel();

        $registerModel->delete($id);
---
DELETE FROM `registers`
WHERE `id` IN ('1')