app/Controllers/Admin/ScheduleController.php

SELECT *
FROM `schedules`
---
    public function index()
    {
        $scheduleModel = new ScheduleModel();

        $schedules = $scheduleModel->findAll();

INSERT INTO `schedules` (`course_id`, `instructor_id`, `schedule_date`, `schedule_time`, `created_at`, `updated_at`) VALUES ('3', '2', '2025-01-09', '07:07', '2025-01-08 06:03:42', '2025-01-08 06:03:42')
---
    public function store()
    {
        $this->scheduleModel->save([
            'course_id' => $this->request->getPost('course_id'),
            'instructor_id' => $this->request->getPost('instructor_id'),
            'schedule_date' => $this->request->getPost('schedule_date'),
            'schedule_time' => $this->request->getPost('schedule_time')
        ]);