app/Controllers/User/CheckoutController.php

    public function checkout()
    {
        // Menyimpan data ke database
        $data = [
            'name' => $this->request->getPost('name'),
            'address' => $this->request->getPost('address'),
            'gender' => $this->request->getPost('gender'),
            'no_hp' => $this->request->getPost('no_hp'),
            'schedule_id' => $this->request->getPost('schedule_id'),
        ];

        // Menyimpan data checkout ke dalam tabel register
        $this->registerModel->save($data);
---
INSERT INTO `registers` (`name`, `address`, `gender`, `no_hp`, `schedule_id`) VALUES ('Aden Arista', 'Jaalan CInta', 'Laki-laki', '6285374663122', '1')