app/Controllers/CourseController.php

    public function index()
    {
        // Mengambil semua data kursus
        $data['courses'] = $this->courseModel->findAll();
---
SELECT *
FROM `courses`