app/Controllers/Home.php

SELECT *
FROM `schedules`
SELECT *
FROM `courses`
SELECT *
FROM `instructors`
---
    public function index()
    {
        $scheduleModel = new ScheduleModel();
        $courseModel = new CourseModel();
        $instructorModel = new InstructorModel();

        $schedules = $scheduleModel->findAll();
        // Tambahkan relasi manual ke setiap jadwal
        foreach ($schedules as &$schedule) {
            $schedule['getCourse'] = $scheduleModel->getCourse($schedule['course_id']);
            $schedule['getInstructor'] = $scheduleModel->getInstructor($schedule['instructor_id']);
        }

        $courses = $courseModel->findAll();
        $instructors = $instructorModel->limit(4)->findAll();