app/Controllers/InstructorController.php

SELECT *
FROM `instructors`
---
    public function index()
    {
        $data['instructors'] = $this->instructorModel->findAll();