app/Controllers/ScheduleController.php

    public function create()
    {
        $data['courses'] = $this->courseModel->findAll();
        $data['instructors'] = $this->instructorModel->findAll();
---
SELECT *
FROM `courses`
SELECT *
FROM `instructors`

    public function edit($id)
    {
        $data['schedule'] = $this->scheduleModel->find($id);
        $data['courses'] = $this->courseModel->findAll();
        $data['instructors'] = $this->instructorModel->findAll();
---
SELECT *
FROM `schedules`
WHERE `schedules`.`id` = '1'
SELECT *
FROM `courses`
SELECT *
FROM `instructors`