app/Models/ScheduleModel.php

    public function getSchedulesWithCourseAndInstructor()
    {
        // Melakukan join dengan tabel courses dan instructors
        return $this->select('schedules.id, courses.name as course_name, instructors.name as instructor_name, schedules.schedule_date, schedules.schedule_time')
                    ->join('courses', 'courses.id = schedules.course_id')
                    ->join('instructors', 'instructors.id = schedules.instructor_id')
                    ->findAll();
---
SELECT `schedules`.`id`, `courses`.`name` as `course_name`, `instructors`.`name` as `instructor_name`, `schedules`.`schedule_date`, `schedules`.`schedule_time`
FROM `schedules`
JOIN `courses` ON `courses`.`id` = `schedules`.`course_id`
JOIN `instructors` ON `instructors`.`id` = `schedules`.`instructor_id`