app/Models/ScheduleModel.php

SELECT `name`
FROM `courses`
WHERE `id` = '1'
---
    public function getCourse($scheduleId)
    {
        return $this->db->table('courses')
                        ->select('name')
                        ->where('id', $scheduleId)
                        ->get()
                        ->getRow();

SELECT `name`
FROM `instructors`
WHERE `id` = '9'
---
    public function getInstructor($instructorId)
    {
        return $this->db->table('instructors')
                        ->select('name')
                        ->where('id', $instructorId)
                        ->get()
                        ->getRow();